{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: shopping cart with badge, cart modal with WhatsApp checkout, four-product catalog, and hero section with gradient text and CTAs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing component responsibilities, state management, styling, and integration patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system, light/dark theme variables, and global base styles for the application.",
  "frontend/index.html": "HTML entry point with FontAwesome CDN link and page title for Veer Mahadev Plastic wholesale shopping center.",
  "frontend/src/App.tsx": "Root application component orchestrating navigation, hero, product sections, footer, chatbot, and cart modal with shared cart open/close state.",
  "frontend/src/components/BestSellers.tsx": "Best sellers section displaying three products in a responsive grid with images, descriptions, best-seller badge, and WhatsApp inquiry links.",
  "frontend/src/components/CartModal.tsx": "Right-sliding cart modal showing cart items with remove buttons and WhatsApp checkout that constructs order message from cart contents.",
  "frontend/src/components/Chatbot.tsx": "Interactive chatbot with bouncing bubble trigger, expandable chat window, keyword-based responses about pricing and address, and 800ms bot reply delay.",
  "frontend/src/components/Footer.tsx": "Dark footer with business details, GST registration notice, WhatsApp/phone contact icons, copyright, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section with dark-overlay background image, gradient text heading, subtitle about wholesale supply, and CTAs for viewing products and WhatsApp chat.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation bar component with brand logo, smooth-scroll menu buttons (Home, Products, About), WhatsApp order link, and a shopping cart icon with item count badge.",
  "frontend/src/components/ProductCatalog.tsx": "Product catalog grid displaying four plastic products (buffer plates, marriage combo, food containers, silver foil) with images, descriptions, wholesale pricing, and add-to-cart buttons.",
  "frontend/src/components/ProductShowcase.tsx": "Featured product showcase for the Marriage Full Combo Pack with image, pricing (₹1,999 with 23% discount), product details, and a WhatsApp order button.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store for managing shopping cart state with methods to add, remove, clear items, and retrieve cart count and items.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login status, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating all functionality is handled client-side with no backend queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, brand colors (red accent), Poppins font, and custom animations for product cards.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom color palette using OKLCH color space, brand-red variants, custom border radius, shadows, and animation keyframes.",
  "project_state.json": "Project state file documenting an e-commerce landing page for Veer Mahadev Plastic wholesale business with 13 product categories, WhatsApp ordering integration, shopping cart functionality, and mobile-first responsive design using Tailwind CSS. Includes architectural notes on sticky navigation, cart modal with localStorage persistence, chatbot interface, and required product images with specific dimensions."
}
